{
    "test": "test",
    "Projects": [
        {
            "major": 1,
            "name": "Solutions in Perception Challenge",
            "img": "projects/imgs/VPML_sip.png",
            "show": 1,
            "url": "",
            "tags": [
                "Vision",
                "Class",
                "Visual and Perceptual Machines Lab"
            ],
            "period": "Spring",
            "year": 2011,
            "date": 2011.2,
            "description": "Abstract: We present an entry into the Solutions in Perceptions Challenge as part of the 2011 International Conference on Robotics and Automation (ICRA). The goal of this competition is to determine the pose and classification of household objects within a series of increasingly complex scenes using an XBox Kinect. Contributions are made in the training and detection phases of our system. Through evaluation we ultimately found the best results using a table-removal-based object detection system, texture-based classification using the Scale-Invariant Feature Transform (SIFT) and pose estimation using Multi-Resolution Occupied Lists (MROL). Preliminary results show high classification accuracy and adequate pose estimation on the training datasets." 
            },
        {
            "major": 1,
            "name": "Analysis of Error-resistant Classification Models",
            "img": "projects/imgs/CSE473.png",
            "show": 1,
            "url": "",
            "tags": [
                "Class",
                "Vision"
            ],
            "period": "Fall",
            "year": 2010,
            "date": 2010.4000000000001,
            "description": "Abstract: The K-Nearest Neighbors classifier is evaluated on data sets which are sampled from separate Gaussian distributions. Experiments are conducted to determine the accuracy of classification on samples (1) using various numbers of neighbors (k=1...9), (2) from distributions with varying means, and (3) that are injected with false initial class labels. Accuracy is found to rise moderately with an increase in the number of neighbors in most cases. When distributions are close in proximity the effect of injecting a large number of \"false\" labelled data points has a relatively small effect."
        },
        {
            "major": 0,
            "name": "Engineering Design Philosophy",
            "img": "projects/imgs/MAE451.jpeg",
            "show": 1,
            "url": "",
            "tags": [
                "Class"
            ],
            "period": "Fall",
            "year": 2010,
            "date": 2010.4000000000001,
            "description": ""
        },
        {
            "major": 1,
            "name": "Bayesian Object Detection on a Mobile Robot",
            "img": "projects/imgs/VPML_hmrf.png",
            "show": 1,
            "url": "",
            "tags": [
                "Vision",
                "Robotics",
                "Haptics",
                "UB Robotics Club",
                "Visual and Perceptual Machines Lab"
            ],
            "period": "Fall",
            "year": 2010,
            "date": 2010.4000000000001,
            "description": "Abstract: Object detection and classiﬁcation using video is necessary for intelligent planning and navigation on a mobile robot. However, current methods can be too slow or not sufﬁcient for distinguishing multiple classes. Techniques that rely on binary (foreground/background) labels incorrectly identify areas with multiple overlapping objects as single segment. We propose two Hierarchical Markov Random Field models in efforts to distinguish connected objects using tiered, binary label sets. Near-realtime performance has been achieved using efﬁcient optimization methods which runs up to 11 frames per second on a dual core 2.2 Ghz processor. Evaluation of both models is done using footage taken from a robot obstacle course at the 2010 Intelligent Ground Vehicle Competition."
        },
        {
            "major": 0,
            "name": "Statistical Methods for Haptic Skill Transference",
            "img": "projects/imgs/MAE377.jpeg",
            "show": 0,
            "url": "",
            "tags": [
                "Haptics",
                "Automation, Robotics & Mechatronics Lab"
            ],
            "period": "Fall",
            "year": 2010,
            "date": 2010.4000000000001,
            "description": ""
        },
        {
        	"major":1, 
            "name": "Image-based, Geometric Sensing in Unstructured Environments ",
            "img": "projects/imgs/FRC_merged_pc.png",
            "show": 1,
            "url": "",
            "tags": [
                "Vision",
                "Robotics",
                "Field Robotics Center"
            ],
            "period": "Summer",
            "year": 2010,
            "date": 2010.3,
            "description": "Structured Light and Stereo Vision techniques were investigated for use in rocky, unstructured environments. Mine accidents around the world cause thousands of deaths every year. For safety reasons it is often not feasible for rescue crews to travel deep into the mine. Additionally, current maps in many of these facilities are inaccurate or incomplete. Algorithms were implemented to generate 3D models using multi-camera and camera-projectors techniques with evaluation at the Bruceton Research Mine and Walkers Mill Cave in Pennsylvania. "
        },
        {
        	"major":1, 
            "name": "Low Cost Five DoF Haptic Device",
            "img": "projects/imgs/ARM_5dof.jpg",
            "tags": [
                "Haptics",
                "Automation & Robotics Lab"
            ],
            "url": "https://sites.google.com/site/colincsl/armlab/5dof_haptics",
            "show": 1,
            "period": "Spring",
            "year": 2010,
            "date": 2010.2,
            "description": "Developed a novel, low-cost 5-degree of freedom haptic device using two Novint Falcon's and wrote a corresponding rigid body haptic renderer. "
        },
        {
        	"major":1, 
            "name": "IGVC: Motion Planning, testing, report, and presentation",
            "img": "projects/imgs/UBR_igvc.jpeg",
            "tags": [
                "Robotics",
                "UB Robotics Club"
            ],
            "url": "",
            "show": 1,
            "period": "Spring",
            "year": 2010,
            "date": 2010.2,
            "description": ""
        },
        {
            "name": "Haptic Rendering and Visualization",
            "img": "projects/imgs/ARM_haptic_viz.jpeg",
            "show": 1,
            "url": "",
            "tags": [
                "Haptics",
                "Automation & Robotics Lab"
            ],
            "period": "Fall",
            "year": 2009,
            "date": 2009.4000000000001,
            "description": "This work explored a variety of haptic rendering methods using a Novint Falcon and Phantom Omni. I have developed a two-dimensional haptic rendering method within Simulink and evaluated an open source haptics platform, H3D, to learn more about algorithms and experiment using custom 3D models and force events."
        },
        {
            "name": "Analysis of a parallel 3PPR and serial PPRR mechanism",
            "img": "projects/imgs/MAE493.jpeg",
            "tags": [
                "Class"
            ],
            "url": "",
            "show": 1,
            "period": "Fall",
            "year": 2009,
            "date": 2009.4000000000001,
            "description": "We proposed an investigation of a PPRR and 3PPR manipulator. This includes inverse kinematics and control of each."
        },
        {
            "name": "Product/CAD design Children's car beverage holder",
            "img": "projects/imgs/MAE377.jpeg",
            "tags": [
                "Class"
            ],
            "url": "",
            "show": 1,
            "period": "Fall",
            "year": 2009,
            "date": 2009.4000000000001,
            "description": "Hot beverages when spiled on skin have the potential to permanently scar individuals. A novel solution is developed in CAD using ProEngineer."
        },
        {
        	"major":1, 
            "name": "Haptic Rendering of Virtual Mechanisms",
            "img": "projects/imgs/ARM_virtual_mech.jpeg",
            "show": 1,
            "url": "",
            "tags": [
                "Haptics",
                "Automation & Robotics Lab"
            ],
            "period": "Summer",
            "year": 2009,
            "date": 2009.3,
            "description": "Mechanism development is often an important element of mechanical design used to constrain moving parts in an assembly. These articulated systems are unintuitive to new designers and are not ease to demonstrate on paper. This work enhances previous visual-based methods of teaching mechanism theory by adding a haptic component that allows users to feel workspace and manipulability characteristics. This document details the implementation done using Matlab/Simulink and additionally includes a tutorial on SimMechanics."
        },
        {
        	"major": 1,
            "name": "IGVC: State Estimation, Path Planning, Design Report",
            "img": "projects/imgs/UBR_igvc.jpeg",
            "show": 1,
            "url": "",
            "tags": [
                "Robotics",
                "UB Robotics Club"
            ],
            "period": "Spring",
            "year": 2009,
            "date": 2009.2,
            "description": ""
        },
        {
        	"major":1, 
            "name": "Teleoperation and Interaction of a Mobile Robot",
            "img": "projects/imgs/ARM_teleop.png",
            "show": 1,
            "url": "",
            "tags": [
            	"Robotics",
                "Automation & Robotics Lab"
            ],
            "period": "Fall",
            "year": 2008,
            "date": 2008.4000000000001,
            "description": "Teleoperation of a mobile robot is difficult because the user often does not have an intuitive method of controlling the vehicle. Multiple modalities of user interaction are explored using a framework developed in Matlab. Gestural interfaces, a graphical user interface, and internet-based teleoperation are evaluated in order to examine ease of use and effectiveness."
        },
        {
            "name": "Battlebots",
            "img": "projects/imgs/UBR_battlebot.jpeg",
            "show": 1,
            "url": "http://sites.google.com/site/colincsl/ubr/battlebots",
            "tags": [
            	"Other",
                "UB Robotics Club"
            ],
            "period": "Spring",
            "year": 2008,
            "date": 2008.3,
            "type": "project",
            "description": "Helped design and manufacture a battlebot for an intra-university competition amongst the various engineering clubs."
        }
    ]
}